doc/html/elements/wizard.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Wizard Element</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Wizard Element"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:43 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href='../stylesheet.css' rel='stylesheet' type='text/css' />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Wizard Element</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html"><b>Elements</b></a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html">Handlers</a> | <a href="../config.html">Configuration Options</a> | <a href="../advanced.html">Advanced Guides</a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Wizard Element - #wizard{}</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Wizard Element - #wizard{}</h2>
<div class="outline-text-2" id="text-1">


<p>
  The Wizard element is an element to simply present a multi-step process to
  the user throught a single unifying element.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Usage</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="src src-erlang">#<span class="org-type">wizard</span>{
   tag=the_wizard,
   titles=[<span class="org-variable-name">Step1Title</span>, <span class="org-variable-name">Step2Title</span>, <span class="org-variable-name">Step3Title</span>, ...],
   steps=[<span class="org-variable-name">Step1Body</span>, <span class="org-variable-name">Step2Body</span>, <span class="org-variable-name">Step3Body</span>, ...]
}.

...

<span class="org-function-name">wizard_event</span>(the_wizard) -&gt;
   <span class="org-type">wf</span>:<span class="org-type">wire</span>(#<span class="org-type">alert</span>{text=<span class="org-string">"Congrats, you finished the wizard!"</span>}).
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Callback</h3>
<div class="outline-text-3" id="text-1-2">


<p>
   Your page must export a <code>wizard_event(Tag)</code> function, which will be called
   when the "Finish" button is clicked on the Wizard.
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> Attributes</h3>
<div class="outline-text-3" id="text-1-3">


<dl>
<dt>tag - (<i>Erlang term</i>)</dt><dd>The identifying tag to be sent to the wizard

</dd>
<dt>titles - (<i>list of strings</i>)</dt><dd>The list of title strings for each step.

</dd>
<dt>steps - (<i>list of step bodies</i>)</dt><dd>A list of Nitrogen "bodies". Each item
</dd>
</dl>

<p>   in this list will be considered as a <code>body</code> attribute for each step.  There
   must be exactly the same number of items in the <code>titles</code> list as there are
   in the <code>steps</code> list.
</p>
<dl>
<dt>next - (<i>string</i>)</dt><dd>The text of the "Next" button, which takes the user
</dd>
</dl>

<p>   to the next step in the wizard (default: "Next")
</p>
<dl>
<dt>back - (<i>string</i>)</dt><dd>The text of the "Back" button, which takes the user
</dd>
</dl>

<p>   to the previous step in the wizard (default: "Back")
</p>
<dl>
<dt>finish - (<i>string</i>)</dt><dd>The text of the "Finish" button, which is presented
</dd>
</dl>

<p>   on the last step, and triggers the <code>wizard_event/1</code> callback on your page.
</p>
<dl>
<dt>show_progress - (<i>boolean</i>)</dt><dd>Show the progress through the wizard.

</dd>
<dt>progress_text - (<i>string</i>)</dt><dd>The text progress "meter", the first <code>~p</code>
</dd>
</dl>

<p>   will be replaced with the current steps, and the second <code>~p</code> will be
   replaced with the total number of steps. For example, ="Step 6 of 12"=.
   (Default: ="Step ~p of ~p"=)
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> Other Important Information</h3>
<div class="outline-text-3" id="text-1-4">


<p>
   The current implementation of the <code>#wizard</code> element does not allow for
   multiple wizards on a single page.
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3"></span> Wiring Validators</h3>
<div class="outline-text-3" id="text-1-5">


<p>
   Wiring validators to the Wizard element can be a little trickier than usual.
   There are "Next" and "Back" buttons on both the top and bottom of the
   wizard. You want to make sure you wire validators to <b>both</b> buttons. As
   such.
</p>
<p>
   Further, since the "Back" button could very well be executed with an empty
   form, so it's not recommended to attempt to validate on the "Back" button,
   only to validate on the next buttons.
</p>
<p>
   So with that said, to validate a field, you want to wire the validation to
   both "Next" or "Finish" buttons (if it's the last step, it'll be the
   "Finish" button). You can determine the <code>id=s of the next and finish buttons    using the =element_wizard:next_button_ids(Step, NumSteps</code> function, where
   <code>Step</code> is the <b>current</b> step, and <b>NumSteps</b> is the total number of steps in
   the Wizard.
</p>
<p>
   For example, assuming you have a field called <code>pet_name</code> in step 2 (of 5 steps) that you wish to be a required field, you would wire the validator as follows:
</p>



<pre class="src src-erlang">Buttonids = <span class="org-type">element_wizard</span>:<span class="org-type">next_button_ids</span>(2, 5),
<span class="org-variable-name">Validator</span> = #<span class="org-type">validate</span>{validators=#<span class="org-type">is_required</span>{text=<span class="org-string">"Required"</span>}},
[<span class="org-type">wf</span>:<span class="org-type">wire</span>(<span class="org-variable-name">Buttonid</span>, pet_name, <span class="org-variable-name">Validator</span>) <span class="org-keyword">||</span> <span class="org-variable-name">Buttonid</span> <span class="org-keyword">&lt;-</span> <span class="org-variable-name">Buttonids</span>].
</pre>


</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-6">


<ul>
<li><a href="./base.html">base element</a>

</li>
<li><a href="http://nitrogenproject.com/demos/wizard">Wizard Demonstration</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:43 CST</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/elements/wizard.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
